In [1]:
# Import dependencies
import pandas as pd

In [10]:
csv1 = pd.read_csv("Resources/AVELISPRI_Denver.csv")
csv1.head()

        Date  Average List Price
0   7/1/2016              672224
1   8/1/2016              663229
2   9/1/2016              658059
3  10/1/2016              660494
4  11/1/2016              667987

In [11]:
csv2 = pd.read_csv("Resources/MEDLISPRI_Denver.csv")
csv2.head()

        Date  Median List Price
0   7/1/2016             495000
1   8/1/2016             490000
2   9/1/2016             489450
3  10/1/2016             489000
4  11/1/2016             497000

In [12]:
merged_data = csv1.merge(csv2,on=["Date"])
merged_data.head()

        Date  Average List Price  Median List Price
0   7/1/2016              672224             495000
1   8/1/2016              663229             490000
2   9/1/2016              658059             489450
3  10/1/2016              660494             489000
4  11/1/2016              667987             497000

In [15]:
# Export the CSV
merged_data.to_csv('MEDandLIST_Denver.csv', index = False)